# STLExportOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
STLExportOptions Constructor
STLExportOptions Class See Also
---
Constructs a new instance of STLExportOptions with default values of all properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public STLExportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
STLExportOptions()
```

# See Also
STLExportOptions Class
STLExportOptions Overload
Autodesk.Revit.DB Namespace